Repository: ArkDeck/ArkDeck
Catalog: ArkDeckApp/Resources/TraceLocalizable.xcstrings
Source language: en
Languages: zh_hans

# trace.action.applyAndStartNamed
source: Apply parameters and start capture (%1$@ · %2$@ s)
zh_hans: 应用参数并开始抓取（%1$@ · %2$@ s）

# trace.action.cancel
source: Cancel after the current safe boundary
zh_hans: 在当前安全边界后取消

# trace.action.openViewer
source: Open trace viewer
zh_hans: 打开 Trace 查看器

# trace.action.refresh
source: Refresh Trace facts
zh_hans: 刷新 Trace 事实

# trace.action.running
source: Capturing…
zh_hans: 抓取中…

# trace.action.startNamed
source: Start capture (%1$@ · %2$@ s)
zh_hans: 开始抓取（%1$@ · %2$@ s）

# trace.artifacts.cleanup
source: Remote cleanup
zh_hans: 远端清理

# trace.artifacts.cleanupAfterPublish
source: Only after verified atomic publication
zh_hans: 仅在验证并原子发布后

# trace.artifacts.contractMissing
source: MISSING
zh_hans: 缺失

# trace.artifacts.contractPartial
source: PARTIAL
zh_hans: 部分

# trace.artifacts.contractPublished
source: PUBLISHED
zh_hans: 已发布

# trace.artifacts.description
source: Raw, filtered, capture log and manifest remain distinct. Contract facts and Runtime-produced metadata are shown separately.
zh_hans: 原始 Trace、筛选结果、采集日志和清单始终分离；契约事实与 Runtime 实际产物元数据分开展示。

# trace.artifacts.runtimeTitle
source: Produced by recent jobs
zh_hans: 近期任务实际产物

# trace.artifacts.filteredDetail
source: Optional host-derived filtering; raw bytes must remain unchanged.
zh_hans: 可选的主机派生筛选；原始字节必须保持不变。

# trace.artifacts.filteredRequested
source: CreateFileAsset filtering requested locally, but no published output artifact exists.
zh_hans: 本地已选择 CreateFileAsset 筛选，但尚无已发布输出产物。

# trace.artifacts.logDetail
source: Tool, phase and validation diagnostics required for a complete Trace session.
zh_hans: 完整 Trace Session 所需的工具、阶段和校验诊断。

# trace.artifacts.manifestDetail
source: Generic indexes are published; Trace-specific before/after/restored parameters and filter statistics are not exposed by this operation.
zh_hans: 已发布通用索引，但此操作未暴露 Trace 专用的参数前后/恢复值及筛选统计。

# trace.artifacts.nonemptyFormatHash
source: Non-empty + recognized format + available checksum
zh_hans: 非空 + 已识别格式 + 可用校验和

# trace.artifacts.partialFirst
source: Host partial before publication
zh_hans: 发布前先写入主机 partial

# trace.artifacts.privacy
source: Privacy
zh_hans: 隐私

# trace.artifacts.rawDetail
source: Immutable device bytes; a zero-byte or unrecognized trace cannot succeed.
zh_hans: 不可变的设备原始字节；零字节或无法识别的 Trace 不能成功。

# trace.artifacts.receive
source: Receive
zh_hans: 接收

# trace.artifacts.role.derived
source: derived (rebuildable)
zh_hans: derived（可重建）

# trace.artifacts.role.raw
source: raw (immutable)
zh_hans: raw（不可变）

# trace.artifacts.sensitive
source: Sensitive, local-first, explicit export
zh_hans: 敏感、本地优先、显式导出

# trace.artifacts.title
source: Artifact completeness
zh_hans: 产物完整性

# trace.artifacts.validate
source: Validation
zh_hans: 校验

# trace.viewer.artifactInvalid
source: Capture completed, but Runtime did not publish exactly one valid raw trace. Open the Job in History to inspect its Artifacts.
zh_hans: 采集已完成，但 Runtime 未发布唯一且有效的原始 Trace。请在历史记录中打开该 Job 检查产物。

# trace.viewer.artifactListUnavailable
source: Capture completed, but its Artifact list is unavailable. Refresh Runtime and try opening the trace again.
zh_hans: 采集已完成，但产物列表不可用。请刷新 Runtime 后重试打开 Trace。

# trace.viewer.opened
source: Trace sent to the viewer
zh_hans: Trace 已送入查看器

# trace.viewer.preparing
source: Verifying and opening the captured trace…
zh_hans: 正在校验并打开已采集的 Trace…

# trace.viewer.readFailed
source: Capture completed, but the trace could not be read and verified. Refresh Runtime and try again.
zh_hans: 采集已完成，但 Trace 无法读取并校验。请刷新 Runtime 后重试。

# trace.viewer.stagingUnavailable
source: Capture completed, but ArkDeck could not create its protected local Trace inbox. Check available storage and try again.
zh_hans: 采集已完成，但 ArkDeck 无法创建受保护的本地 Trace 收件目录。请检查可用存储空间后重试。

# trace.viewer.tryAgain
source: Try opening trace again
zh_hans: 重试打开 Trace

# trace.availability.adapter
source: Per-device adapter facts
zh_hans: 逐设备 Adapter 事实

# trace.availability.available
source: Diagnostics operation is available
zh_hans: 诊断操作可用

# trace.availability.categories
source: Typed trace categories
zh_hans: 类型化 Trace 分类

# trace.availability.checking
source: Checking Runtime availability
zh_hans: 正在检查 Runtime 可用性

# trace.availability.parameters
source: Parameter snapshots
zh_hans: 参数快照

# trace.availability.probeGap
source: The App read surface does not expose a target-bound hitrace/bytrace probe, raw help or supported tags. Tool selection and compatibility remain unknown rather than guessed.
zh_hans: App 读面未暴露与目标绑定的 hitrace/bytrace probe、原始 help 或已支持 tag。工具选择与兼容性保持未知，不进行猜测。

# trace.availability.raw
source: Raw trace artifact
zh_hans: 原始 Trace 产物

# trace.availability.title
source: Production capability
zh_hans: 生产能力

# trace.availability.unavailable
source: Diagnostics operation is unavailable
zh_hans: 诊断操作不可用

# trace.blocker.adapter
source: A fresh target-bound adapter probe and raw help family are required.
zh_hans: 需要与当前目标绑定的新鲜 Adapter probe 和原始 help family。

# trace.blocker.buffer
source: Enter a buffer value inside the published KB range.
zh_hans: 请输入已发布 KB 范围内的 buffer 值。

# trace.blocker.checking
source: Wait for current Runtime availability facts.
zh_hans: 等待当前 Runtime 可用性事实。

# trace.blocker.duration
source: Enter a duration inside the published second range.
zh_hans: 请输入已发布秒数范围内的 duration。

# trace.blocker.noTags
source: A capture always carries at least one tag; the current request is empty.
zh_hans: 抓取始终至少带一个 tag；当前请求为空。

# trace.blocker.operation
source: The production diagnostics operation is unavailable.
zh_hans: 生产诊断操作不可用。

# trace.blocker.parameters
source: Typed parameter snapshots and probe dispositions are not available to this App build.
zh_hans: 当前 App 构建无法获取类型化参数快照和 probe disposition。

# trace.blocker.tags
source: Every requested tag is unverified for the selected device and adapter.
zh_hans: 所有请求 tag 均未针对所选设备和 Adapter 验证。

# trace.blocker.target
source: Select an adopted target with a complete durable binding.
zh_hans: 请选择具有完整持久绑定的已接管目标。

# trace.cancel.failed
source: Runtime did not accept cancellation for this App-owned Job.
zh_hans: Runtime 未接受对此 App 所属 Job 的取消请求。

# trace.bounds.bufferConverged
source: The trace buffer converges from the device capability probe; it is not hand-entered.
zh_hans: Trace buffer 按设备能力探测收敛，不接受手输。

# trace.bounds.duration
source: Duration
zh_hans: 时长

# trace.bounds.maxTags
source: Maximum tag count
zh_hans: 最大 tag 数量

# trace.bounds.progressNote
source: No reliable byte-total capability receipt is available. A future active capture must show elapsed time with indeterminate progress, never a fabricated percentage or ETA.
zh_hans: 当前没有可靠的总字节能力回执。未来进行采集时必须显示已用时间和不确定进度，绝不伪造百分比或 ETA。

# trace.bounds.remoteStop
source: Typed remote stop
zh_hans: 类型化远端停止

# trace.bounds.title
source: Capture bounds and progress
zh_hans: 采集边界与进度

# trace.bounds.total
source: Progress mode
zh_hans: 进度模式

# trace.configuration.custom
source: Custom
zh_hans: 自定义

# trace.configuration.mode
source: Tag configuration mode
zh_hans: Tag 配置模式

# trace.configuration.preset
source: Preset
zh_hans: 预设

# trace.configuration.title
source: Preset and adapter-constrained tags
zh_hans: 预设与 Adapter 约束 Tag

# trace.custom.count
source: %lld tags selected.
zh_hans: 已选 %lld 个 tag。

# trace.custom.empty
source: No device-confirmed tags are available. Custom selection is empty, not an unrestricted text field.
zh_hans: 没有设备已确认的 tag。自定义选择为空，不会退化为无限制文本框。

# trace.custom.minimumOne
source: The last selected tag cannot be removed; a capture always carries one tag.
zh_hans: 最后一个已选 tag 不可移除；抓取始终带一个 tag。

# trace.custom.noFreeText
source: Custom can select only tags from a fresh adapter probe; arbitrary tag or command text is prohibited.
zh_hans: 自定义只能选择新鲜 Adapter probe 返回的 tag；禁止任意 tag 或命令文本。

# trace.custom.title
source: Confirmed tags
zh_hans: 已确认 Tag

# trace.filter.createFileAsset
source: Filter CreateFileAsset chatter into a derived trace
zh_hans: 在派生 Trace 中筛除 CreateFileAsset 噪声

# trace.filter.description
source: Filtering is a host post-process. Header-aware parsing decides what may be removed and records deletion statistics.
zh_hans: 筛选属于主机后处理；由识别 header 的 parser 决定可删除内容并记录删除统计。

# trace.filter.rawImmutable
source: The raw artifact is immutable. Derived filtering never overwrites it or deletes a fixed number of leading lines.
zh_hans: 原始产物不可变；派生筛选不会覆盖原始数据，也不会固定删除开头若干行。

# trace.filter.title
source: Derived filtering
zh_hans: 派生筛选

# trace.jobs.readOnly
source: These diagnostics Jobs are read-only. The App cannot infer their optional Trace leg, stop them, cancel them or resume them.
zh_hans: 这些诊断 Job 仅供读取；App 无法推断其可选 Trace leg，也无法停止、取消或恢复。

# trace.jobs.selectionUnknown
source: Diagnostics job — Trace leg selection unknown
zh_hans: 诊断 Job — Trace leg 是否选择未知

# trace.jobs.title
source: Related diagnostics Jobs
zh_hans: 相关诊断 Job

# trace.parameters.after
source: After
zh_hans: 执行后

# trace.parameters.before
source: Before
zh_hans: 原值

# trace.parameters.description
source: Snapshots stay typed as missing, unreadable or exact string values. This table shows Not observed because no target-bound snapshot response exists.
zh_hans: 快照保持 missing、unreadable 或精确字符串值；由于没有与目标绑定的快照响应，此表显示“未读取”。

# trace.parameters.desired
source: Profile value
zh_hans: Profile 值

# trace.parameters.mode.persistentChange
source: Keep profile values
zh_hans: 保持 Profile 值

# trace.parameters.mode.persistentChange.detail
source: Requires per-parameter persistent-write support and a second explicit confirmation.
zh_hans: 需要逐参数持久写支持和第二次明确确认。

# trace.parameters.mode.temporaryRestore
source: Apply temporarily and restore
zh_hans: 临时应用并恢复

# trace.parameters.mode.temporaryRestore.detail
source: Requires exact writable original strings, supported probe receipts and verified readback.
zh_hans: 需要精确且可写回的原始字符串、支持回执及 readback 验证。

# trace.parameters.mode.unchanged
source: Leave parameters unchanged
zh_hans: 参数保持不变

# trace.parameters.mode.unchanged.detail
source: Do not set or restore any debug parameter.
zh_hans: 不设置或恢复任何调试参数。

# trace.parameters.name
source: Parameter
zh_hans: 参数

# trace.parameters.notChanged
source: Not applicable (unchanged)
zh_hans: 不适用（未修改）

# trace.parameters.notObserved
source: Not observed
zh_hans: 未读取

# trace.parameters.missing
source: Missing
zh_hans: 不存在

# trace.parameters.snapshotReady
source: Runtime read all nine parameter states from the selected target. This snapshot grants no write authority; mutation and restore remain unavailable until Runtime has verified per-parameter capability and readback.
zh_hans: Runtime 已从所选目标读取全部九项参数状态。该快照不授予写权限；在 Runtime 验证逐参数能力与回读前，修改与恢复仍不可用。

# trace.parameters.unreadable
source: Unreadable
zh_hans: 不可读

# trace.parameters.persistConfirm
source: I understand these debug parameters remain changed
zh_hans: 我了解这些调试参数会保持变更

# trace.parameters.persistConfirmDetail
source: Confirmation is enabled only after a matching persistent-write capability receipt.
zh_hans: 仅在获得匹配的持久写能力回执后才可确认。

# trace.parameters.rebootTitle
source: Reboot impact
zh_hans: 重启影响

# trace.parameters.rebootUnchanged
source: No reboot is requested while parameters remain unchanged. A future parameter mutation must disclose reboot and durable rebind requirements before dispatch.
zh_hans: 参数保持不变时不会请求重启。未来参数变更必须在派发前说明重启与持久重绑定要求。

# trace.parameters.restore
source: Auto restore
zh_hans: 自动恢复

# trace.parameters.snapshotGap
source: Missing and unreadable are not false or zero. Temporary restore and persistent change stay unavailable until exact snapshots and capability receipts are readable.
zh_hans: missing 与 unreadable 不是 false 或 0。读取到精确快照和能力回执前，临时恢复与持久变更均保持不可用。

# trace.parameters.title
source: Debug parameter snapshot diff
zh_hans: 调试参数快照差异

# trace.preset.arkuiDeep
source: ArkUI deep
zh_hans: ArkUI 深度

# trace.preset.attachmentPanorama
source: Attachment panorama
zh_hans: 附件全景

# trace.preset.attachmentWarning
source: This logical preset carries a historical buffer value of 327680 with an unconfirmed unit. The published KB input caps at 65536; no historical value is applied until the current adapter confirms unit and policy.
zh_hans: 此逻辑预设带有历史 buffer 值 327680，但单位未确认。已发布 KB 输入上限为 65536；当前 Adapter 确认单位和策略前不会应用该历史值。

# trace.preset.label
source: Logical preset
zh_hans: 逻辑预设

# trace.preset.logicalNote
source: A preset is a logical request. Only tags proven by the selected device and adapter may become executable.
zh_hans: 预设是逻辑请求；只有所选设备与 Adapter 证明支持的 tag 才能执行。

# trace.preset.renderAnimation
source: Render / animation
zh_hans: 渲染 / 动画

# trace.preset.schedulingIpc
source: Scheduling / IPC
zh_hans: 调度 / IPC

# trace.probe.rawHelp.empty
source: No target-bound raw help response. This is unknown capability, not an empty tag list.
zh_hans: 没有与目标绑定的原始 help 响应；这表示能力未知，不代表 tag 列表为空。

# trace.probe.rawHelp.title
source: Raw hitrace / bytrace help
zh_hans: hitrace / bytrace 原始 help

# trace.progress.cancelDetail
source: Published capture cancellation is %1$@. Typed remote-stop support is unverified; stop and cancel controls stay unavailable rather than guessing.
zh_hans: 已发布采集取消策略为 %1$@。类型化远端停止能力未验证；停止与取消控件保持不可用。

# trace.progress.cancelTitle
source: Stop and cancellation
zh_hans: 停止与取消

# trace.progress.honestRule
source: During an active capture without reliable total bytes, show an indeterminate indicator and elapsed time. Percentage and ETA remain absent.
zh_hans: 正在采集且没有可靠总字节时，显示不确定进度与已用时间；不显示百分比和 ETA。

# trace.progress.indeterminate
source: Indeterminate; elapsed time only
zh_hans: 不确定；仅显示已用时间

# trace.progress.noActive
source: No active Trace Job is observable
zh_hans: 没有可观察的活动 Trace Job

# trace.progress.noActiveDetail
source: The complete stage model is shown below as Not started. Related diagnostics jobs cannot be relabeled as Trace without their input facts.
zh_hans: 下方完整阶段模型均标记为“未开始”；没有输入事实时，不能把相关诊断 Job 重新标记为 Trace。

# trace.progress.title
source: Progress and cancellation model
zh_hans: 进度与取消模型

# trace.review.blockers
source: Execution blockers
zh_hans: 执行阻断项

# trace.review.cancellation
source: Cancellation
zh_hans: 取消策略

# trace.review.duration
source: Duration
zh_hans: 时长

# trace.review.effect
source: Trace leg effect
zh_hans: Trace leg 效果

# trace.review.ready
source: Target, adapter, tags, bounds and parameter snapshot are ready.
zh_hans: 目标、Adapter、Tag、边界与参数快照均已就绪。

# trace.review.preset
source: Configuration
zh_hans: 配置

# trace.review.tags
source: Logical tags
zh_hans: 逻辑 Tag

# trace.review.target
source: Target
zh_hans: 目标

# trace.review.title
source: Review and run
zh_hans: 审核与运行

# trace.review.typedDispatch
source: The App submits only capture.diagnostics@1 with this exact target, binding, duration and confirmed tag set. Parameters remain unchanged.
zh_hans: App 仅以当前精确目标、binding、时长与已确认 Tag 集提交 capture.diagnostics@1；参数保持不变。

# trace.tags.title
source: Requested tag diff
zh_hans: 请求 Tag 差异

# trace.tags.supported
source: supported by the registered Runtime probe
zh_hans: 已由注册 Runtime 探测确认支持

# trace.tags.unsupported
source: not present in the registered Runtime probe
zh_hans: 不在注册 Runtime 探测结果中

# trace.tags.verifiedCount
source: %1$d of %2$d supported
zh_hans: 已支持 %1$d / %2$d

# trace.tags.verifiedNote
source: Only tags parsed from the exact registered hitrace tag-list family are marked supported; byte-family drift yields no capabilities.
zh_hans: 仅精确匹配已注册 hitrace tag-list 字节族并解析出的 tag 会标记为支持；字节族漂移不会产生任何能力。

# trace.target.adopted
source: Adopted at
zh_hans: 接管时间

# trace.target.binding
source: Binding revision
zh_hans: 绑定修订号

# trace.target.empty
source: No adopted target with complete binding facts is available.
zh_hans: 没有具备完整绑定事实的已接管目标。

# trace.target.label
source: Exact target
zh_hans: 精确目标

# trace.target.title
source: Target and binding
zh_hans: 目标与绑定

# trace.target.tool
source: Adopted tool version
zh_hans: 接管时工具版本

# trace.validation.decimal
source: Use decimal digits only.
zh_hans: 只能输入十进制数字。

# trace.validation.missing
source: A value is required.
zh_hans: 此项为必填。

# trace.validation.range
source: Use a value from %1$d through %2$d.
zh_hans: 请输入 %1$d 到 %2$d 之间的值。

# trace.validation.valid
source: Inside the published range.
zh_hans: 在已发布范围内。

# trace.value.none
source: None
zh_hans: 无

# trace.value.notSelected
source: Not selected
zh_hans: 未选择

# trace.value.selected
source: Selected
zh_hans: 已选择

# trace.value.supported
source: Supported
zh_hans: 支持

# trace.value.unavailable
source: Unavailable
zh_hans: 不可用

# trace.value.unverified
source: Unverified
zh_hans: 未验证
